Public Attributes | List of all members
API_CoverFillTransformation Struct Reference
Element Manager API
Fill orientation and distortion parameters. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Coord  | origo
The origo of the fill relative to the center of the element.
API_Vector  | xAxis
Primary distortion (direction) vector.
API_Vector  | yAxis
Secondary distortion (direction) vector.
Detailed Description
Fill orientation and distortion parameters.
Remarks
This structure holds the orientation and distortion parameters of the cover fills of API_BeamType and API_ColumnType elements.
Member Data Documentation
◆ origo
 API_CoverFillTransformation::origo
The origo of the fill relative to the center of the element.
◆ xAxis
 API_CoverFillTransformation::xAxis
Primary distortion (direction) vector.
◆ yAxis
 API_CoverFillTransformation::yAxis
Secondary distortion (direction) vector.